[
  {
    "quote": "¡Recibí mi pedido en menos de 24 horas! La calidad de las prendas superó todas mis expectativas. El vestido me quedó perfecto como si estuviera hecho a medida.",
    "handle": "carla_martinez"
  },
  {
    "quote": "La asesoría de estilo de G.City transformó mi look. Combinaron piezas que nunca hubiera elegido juntas y ahora son mis outfits favoritos. ¡Increíble servicio!",
    "handle": "sofia_style"
  },
  {
    "quote": "Compré el abrigo de la colección invierno en preventa y valió cada centavo. El material es premium y me ha mantenido abrigada todo el invierno. ¡Volveré a comprar sin duda!",
    "handle": "lucia_invierno"
  },
  {
    "quote": "Hice una devolución y fue el proceso más fácil que he experimentado. Me respondieron en 10 minutos y el reembolso llegó al día siguiente. Excelente servicio postventa.",
    "handle": "ana_satisfecha"
  },
  {
    "quote": "Las tallas de G.City son exactas a lo que describen. Por fin una marca que entiende los cuerpos reales. ¡Mi guardarropa ahora es 80% de ellos!",
    "handle": "marta_tallas"
  },
  {
    "quote": "Pedí un conjunto para una boda con urgencia y no solo llegó a tiempo, sino que recibí cumplidos toda la noche. La tela es tan cómoda como elegante.",
    "handle": "isabel_boda"
  },
  {
    "quote": "Soy cliente desde la primera colección y cada temporada superan la anterior. La lencería es especialmente cómoda y con diseños que celebran todos los cuerpos.",
    "handle": "cliente_fiel"
  },
  {
    "quote": "El paquete llegó impecablemente empaquetado, como un regalo de lujo. Hasta incluían una nota personalizada y tips de cuidado para las prendas. Detalles que marcan la diferencia.",
    "handle": "maria_detalles"
  },
  {
    "quote": "Compré por primera vez en su Black Friday y quedé impresionada. A pesar de la alta demanda, todo llegó perfecto y con increíbles descuentos. ¡Ahora soy fan!",
    "handle": "paty_ofertas"
  },
  {
    "quote": "Como influencer de moda, he trabajado con muchas marcas pero G.City destaca por su autenticidad. Sus diseños únicos siempre generan engagement en mis redes.",
    "handle": "style_by_leo"
  }
]